tap "supabase/tap"

# Shell & Terminal
brew "atuin", restart_service: :changed
brew "fish"
brew "fzf"
brew "starship"
brew "tmux"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Core Tools
brew "bat"
brew "coreutils"
brew "direnv"
brew "eza"
brew "fd"
brew "fortune"
brew "git"
brew "gnupg"
brew "jq"
brew "opencode"
brew "repomix"
brew "ripgrep"
brew "shellcheck"
brew "stow"
brew "terminal-notifier"
brew "wget"

# Development
brew "gh"
brew "go"
brew "neovim"
brew "node"
brew "overmind"
brew "pre-commit"
brew "redis"
brew "stripe-cli"
brew "terraform"
brew "uv"

# Typesetting
brew "tinymist"
brew "typst"
brew "typstyle"

# Security
brew "pinentry-mac"
brew "ykman"
brew "ykpers"

# Supabase
brew "supabase/tap/supabase"

# Fonts
cask "font-cinzel"
cask "font-cinzel-decorative"
cask "font-eb-garamond"
cask "font-jetbrains-mono-nerd-font"

# Applications
cask "bitwarden"
cask "docker-desktop"
cask "figma"
cask "ghostty"
cask "plex"
cask "spotify"

# Go Tools
go "github.com/abenz1267/gomvp"
go "github.com/golang-migrate/migrate/v4/cmd/migrate"
go "github.com/sqlc-dev/sqlc/cmd/sqlc"
