tap "supabase/tap"
tap "thoreinstein/tap"
tap "unrss/tap"
brew "atuin", restart_service: :changed
brew "bat"
brew "coreutils"
brew "direnv"
brew "doppler"
brew "eza"
brew "fd"
brew "fish"
brew "fortune"
brew "fzf"
brew "gh"
brew "git"
brew "gnupg"
brew "go"
brew "jq"
brew "mcp-toolbox"
brew "neovim", args: ["HEAD"]
brew "node"
brew "ripgrep"
brew "opencode"
brew "osv-scanner"
brew "tmux"
brew "overmind"
brew "pinentry-mac"
brew "postgresql@14"
brew "pre-commit"
brew "redis"
brew "repomix"
brew "shellcheck"
brew "starship"
brew "stow"
brew "stripe-cli"
brew "stylua"
brew "terminal-notifier"
brew "terraform"
brew "tinymist"
brew "typst"
brew "typstyle"
brew "uv"
brew "wget"
brew "ykman"
brew "ykpers"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "supabase/tap/supabase"
cask "bitwarden"
cask "cascade"
cask "claude"
cask "codex"
cask "docker-desktop"
cask "figma"
cask "font-cinzel"
cask "font-cinzel-decorative"
cask "font-eb-garamond"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "obsidian"
cask "plex"
cask "rig"
cask "spotify"
go "github.com/air-verse/air"
go "golang.org/x/tools/cmd/callgraph"
go "github.com/spf13/cobra-cli"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/davidrjenni/reftools/cmd/fillswitch"
go "github.com/onsi/ginkgo/v2/ginkgo"
go "github.com/abice/go-enum"
go "mvdan.cc/gofumpt"
go "golang.org/x/tools/cmd/goimports"
go "github.com/twpayne/go-jsonstruct/v3/cmd/gojsonstruct"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "github.com/segmentio/golines"
go "github.com/fatih/gomodifytags"
go "github.com/abenz1267/gomvp"
go "golang.org/x/tools/cmd/gonew"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "gotest.tools/gotestsum"
go "golang.org/x/vuln/cmd/govulncheck"
go "github.com/steveyegge/gastown/cmd/gt"
go "github.com/koron/iferr"
go "github.com/josharian/impl"
go "github.com/tmc/json-to-struct"
go "github.com/golang-migrate/migrate/v4/cmd/migrate"
go "go.uber.org/mock/mockgen"
go "github.com/kyoh86/richgo"
go "github.com/sqlc-dev/sqlc/cmd/sqlc"
go "github.com/a-h/templ/cmd/templ"
